20211012161458-battery_bank.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>battery bank</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">battery bank</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga05b758">battery aging model</a></li>
<li><a href="#orgfd15e44">BMS interface</a></li>
<li><a href="#org3633534">Algorithms</a>
<ul>
<li><a href="#org3590ea3">forcasting</a></li>
<li><a href="#org210b7e6">outlier detection</a></li>
<li><a href="#org261e33b">anomaly detection in time series</a>
<ul>
<li><a href="#org8b46f4b">https://neptune.ai/blog/anomaly-detection-in-time-series</a></li>
<li><a href="#org86863ab">https://towardsdatascience.com/time-series-anomaly-detection-with-pycaret-706a6e2b2427</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org182a972">Modules</a>
<ul>
<li><a href="#org7f0ef45">https://github.com/pycaret/pycaret/tree/master/examples</a></li>
<li><a href="#org5a06d02">https://github.com/facebookresearch/Kats</a>
<ul>
<li><a href="#orgc0c28e3">forcast</a></li>
</ul>
</li>
<li><a href="#org23dd7d1">https://github.com/pycaret/pycaret</a></li>
</ul>
</li>
<li><a href="#org245c0c7">Methods</a>
<ul>
<li><a href="#org9b5f9e8">preprocessing: torque requrest &amp; battery response decomposition</a>
<ul>
<li><a href="#orgbffbcf8">SARIMA:</a></li>
<li><a href="#orgb0bd384">Prophet: https://facebook.github.io/prophet/#:~:text=Prophet%20is%20a%20procedure%20for,daily%20seasonality%2C%20plus%20holiday%20effects.&amp;text=Prophet%20is%20robust%20to%20missing,and%20typically%20handles%20outliers%20well.</a></li>
<li><a href="#orga7a9cda">Holt-Winters</a></li>
<li><a href="#orgfd598af">ensemble</a></li>
</ul>
</li>
<li><a href="#org4723ae7">forecasting with Kat/PyCaret</a></li>
</ul>
</li>
<li><a href="#orgff695e2">Project</a>
<ul>
<li><a href="#org30fd322">Fiasco/Funes</a></li>
<li><a href="#orge118f4a">Hail Mary/Dataphage(Astrophage)</a></li>
<li><a href="#org91c6b4a">Nabis/Impressionist</a></li>
</ul>
</li>
<li><a href="#org483a4cd">Retrospection</a>
<ul>
<li><a href="#org11d4527">no labels (expert knowledge) for supervised learning</a></li>
<li><a href="#orgae3b1b3">challenge and caveats for unsuperviesd learning:</a>
<ul>
<li><a href="#org31f812f">relevant features to reflect intrinsic parameters of battery health</a></li>
<li><a href="#org881bc44">when the features are relevant, sufficient <b>finite</b> data to represent this distribution</a></li>
<li><a href="#org816b7fa">optimal architecture for G and D (optimize weights) :</a></li>
<li><a href="#org4833071">no guarantee for convergence</a></li>
<li><a href="#orge849720">CGAN and feature labels?</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
:ID:       b2f068c3-a99a-4493-af4e-8f2762d9cb94
</p>
<p>
<a href="./20210831171810-battery.html">battery</a>
</p>

<div id="outline-container-orga05b758" class="outline-2">
<h2 id="orga05b758"><a href="./20211012161557-battery_aging_model.html">battery aging model</a></h2>
</div>
<div id="outline-container-orgfd15e44" class="outline-2">
<h2 id="orgfd15e44"><a href="./20211012161635-bms_interface.html">BMS interface</a></h2>
</div>
<div id="outline-container-org3633534" class="outline-2">
<h2 id="org3633534">Algorithms</h2>
<div class="outline-text-2" id="text-org3633534">
</div>
<div id="outline-container-org3590ea3" class="outline-3">
<h3 id="org3590ea3">forcasting</h3>
</div>
<div id="outline-container-org210b7e6" class="outline-3">
<h3 id="org210b7e6">outlier detection</h3>
</div>
<div id="outline-container-org261e33b" class="outline-3">
<h3 id="org261e33b">anomaly detection in time series</h3>
<div class="outline-text-3" id="text-org261e33b">
</div>
<div id="outline-container-org8b46f4b" class="outline-4">
<h4 id="org8b46f4b"><a href="https://neptune.ai/blog/anomaly-detection-in-time-series">https://neptune.ai/blog/anomaly-detection-in-time-series</a></h4>
<div class="outline-text-4" id="text-org8b46f4b">
</div>
<ul class="org-ul">
<li><a id="org6b5de21"></a>STL deomposition seasonal, trend and residue<br /></li>
<li><a id="org11335d6"></a>detection using forecasting<br /></li>
<li><a id="orgface13d"></a>classification and regression tree (CART)<br /></li>
</ul>
</div>
<div id="outline-container-org86863ab" class="outline-4">
<h4 id="org86863ab"><a href="https://towardsdatascience.com/time-series-anomaly-detection-with-pycaret-706a6e2b2427">https://towardsdatascience.com/time-series-anomaly-detection-with-pycaret-706a6e2b2427</a></h4>
</div>
</div>
</div>
<div id="outline-container-org182a972" class="outline-2">
<h2 id="org182a972">Modules</h2>
<div class="outline-text-2" id="text-org182a972">
</div>
<div id="outline-container-org7f0ef45" class="outline-3">
<h3 id="org7f0ef45"><a href="https://github.com/pycaret/pycaret/tree/master/examples">https://github.com/pycaret/pycaret/tree/master/examples</a></h3>
</div>
<div id="outline-container-org5a06d02" class="outline-3">
<h3 id="org5a06d02"><a href="https://github.com/facebookresearch/Kats">https://github.com/facebookresearch/Kats</a></h3>
<div class="outline-text-3" id="text-org5a06d02">
</div>
<div id="outline-container-orgc0c28e3" class="outline-4">
<h4 id="orgc0c28e3">forcast</h4>
</div>
</div>
<div id="outline-container-org23dd7d1" class="outline-3">
<h3 id="org23dd7d1"><a href="https://github.com/pycaret/pycaret">https://github.com/pycaret/pycaret</a></h3>
</div>
</div>
<div id="outline-container-org245c0c7" class="outline-2">
<h2 id="org245c0c7">Methods</h2>
<div class="outline-text-2" id="text-org245c0c7">
</div>
<div id="outline-container-org9b5f9e8" class="outline-3">
<h3 id="org9b5f9e8">preprocessing: torque requrest &amp; battery response decomposition</h3>
<div class="outline-text-3" id="text-org9b5f9e8">
</div>
<div id="outline-container-orgbffbcf8" class="outline-4">
<h4 id="orgbffbcf8">SARIMA:</h4>
<div class="outline-text-4" id="text-orgbffbcf8">
</div>
<ul class="org-ul">
<li><a id="org5a8aeff"></a><a href="https://machinelearningmastery.com/sarima-for-time-series-forecasting-in-python/">https://machinelearningmastery.com/sarima-for-time-series-forecasting-in-python/</a><br /></li>
<li><a id="orge8fc488"></a><a href="https://medium.com/@kfoofw/seasonal-lags-sarima-model-fa671a858729">https://medium.com/@kfoofw/seasonal-lags-sarima-model-fa671a858729</a><br /></li>
</ul>
</div>
<div id="outline-container-orgb0bd384" class="outline-4">
<h4 id="orgb0bd384">Prophet: <a href="https://facebook.github.io/prophet/#:~:text=Prophet%20is%20a%20procedure%20for,daily%20seasonality%2C%20plus%20holiday%20effects.&amp;text=Prophet%20is%20robust%20to%20missing,and%20typically%20handles%20outliers%20well">https://facebook.github.io/prophet/#:~:text=Prophet%20is%20a%20procedure%20for,daily%20seasonality%2C%20plus%20holiday%20effects.&amp;text=Prophet%20is%20robust%20to%20missing,and%20typically%20handles%20outliers%20well</a>.</h4>
</div>
<div id="outline-container-orga7a9cda" class="outline-4">
<h4 id="orga7a9cda">Holt-Winters</h4>
<div class="outline-text-4" id="text-orga7a9cda">
<p>
<a href="https://orangematter.solarwinds.com/2019/12/15/holt-winters-forecasting-simplified/#:~:text=Holt%2DWinters%20is%20a%20model,cyclical%20repeating%20pattern%20(seasonality)">https://orangematter.solarwinds.com/2019/12/15/holt-winters-forecasting-simplified/#:~:text=Holt%2DWinters%20is%20a%20model,cyclical%20repeating%20pattern%20(seasonality)</a>.
<a href="https://otexts.com/fpp2/holt-winters.html">https://otexts.com/fpp2/holt-winters.html</a>
</p>
</div>
</div>
<div id="outline-container-orgfd598af" class="outline-4">
<h4 id="orgfd598af">ensemble</h4>
</div>
</div>
<div id="outline-container-org4723ae7" class="outline-3">
<h3 id="org4723ae7">forecasting with Kat/PyCaret</h3>
</div>
</div>
<div id="outline-container-orgff695e2" class="outline-2">
<h2 id="orgff695e2">Project</h2>
<div class="outline-text-2" id="text-orgff695e2">
</div>
<div id="outline-container-org30fd322" class="outline-3">
<h3 id="org30fd322">Fiasco/Funes</h3>
</div>
<div id="outline-container-orge118f4a" class="outline-3">
<h3 id="orge118f4a">Hail Mary/Dataphage(Astrophage)</h3>
</div>
<div id="outline-container-org91c6b4a" class="outline-3">
<h3 id="org91c6b4a">Nabis/Impressionist</h3>
</div>
</div>
<div id="outline-container-org483a4cd" class="outline-2">
<h2 id="org483a4cd">Retrospection</h2>
<div class="outline-text-2" id="text-org483a4cd">
</div>
<div id="outline-container-org11d4527" class="outline-3">
<h3 id="org11d4527">no labels (expert knowledge) for supervised learning</h3>
</div>
<div id="outline-container-orgae3b1b3" class="outline-3">
<h3 id="orgae3b1b3">challenge and caveats for unsuperviesd learning:</h3>
<div class="outline-text-3" id="text-orgae3b1b3">
</div>
<div id="outline-container-org31f812f" class="outline-4">
<h4 id="org31f812f">relevant features to reflect intrinsic parameters of battery health</h4>
<div class="outline-text-4" id="text-org31f812f">
</div>
<ul class="org-ul">
<li><a id="orge7d67a2"></a>the distribution of battery health state depending on those parameters<br /></li>
</ul>
</div>
<div id="outline-container-org881bc44" class="outline-4">
<h4 id="org881bc44">when the features are relevant, sufficient <b>finite</b> data to represent this distribution</h4>
<div class="outline-text-4" id="text-org881bc44">
</div>
<ul class="org-ul">
<li><a id="org39efc4e"></a>Example: Gaussian/uniform; GT distribution is the unknown (nonlinear, multimodal, non-stationary) natural density of data: distribution \(p_{\xi}\) &#x2013;&gt; Neural Network v\(p_{\theta}\)<br />
<ul class="org-ul">
<li><a id="orgaa95d4b"></a>NN very versatile: \(p_{\theta}\) can approxmate any distribution!<br /></li>
<li><a id="org832b454"></a>prior \(p(z)\) has an impact on the final sample and capability of the whole network: \(p(z) \odot p_{\theta}(x)\)<br /></li>
<li><a id="orga5bd75c"></a>if enough expert knowledge is available tell us it's normal distribution, just 2 parameters to estimate, still a lot of samples for bootstrapping/bagging, sample mean / sample variance, need confidence level, statistical trial for inspection.<br /></li>
</ul>
</li>
<li><a id="org53142b9"></a>scenario data (time sequences of specific scenes)<br /></li>
<li><a id="org2eaae97"></a>given the current compute resources: the way to go is to reduce the data amount requirement by defining relevant features and relevant scenarios<br /></li>
</ul>
</div>
<div id="outline-container-org816b7fa" class="outline-4">
<h4 id="org816b7fa">optimal architecture for G and D (optimize weights) :</h4>
<div class="outline-text-4" id="text-org816b7fa">
</div>
<ul class="org-ul">
<li><a id="orgc5ac8e1"></a>multidimensional continuous function enough? More expertise to make this happen!<br />
<ul class="org-ul">
<li><a id="org3c22d5c"></a>transformer for sequential modeling<br /></li>
<li><a id="org86ca92b"></a>make prior learnable<br /></li>
</ul>
</li>
<li><a id="orga4c147e"></a>optimal hyperparameters?<br /></li>
</ul>
</div>
<div id="outline-container-org4833071" class="outline-4">
<h4 id="org4833071">no guarantee for convergence</h4>
</div>
<div id="outline-container-orge849720" class="outline-4">
<h4 id="orge849720">CGAN and feature labels?</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
